liquidware/antipasto_arduino/hardware/boards.txt
##############################################################
#Board Description

template.name=Template (not active)
template.group=Arduino
template.build.core=template
template.reference=hardware/cores/arduino/reference/index.html

#ANT core targets
template.targets.sketch.verify=build.all
template.targets.sketch.upload=upload.sketch
template.targets.bootloader.upload=upload.bootloader

##############################################################
#Board Description

ixm.name=Illuminato X Machina
ixm.group=Illuminato
ixm.build.core=ixm
ixm.reference=hardware/cores/ixm/reference/index.html

#ANT core targets
ixm.targets.sketch.verify=build.all
ixm.targets.sketch.upload=upload.sketch
ixm.targets.bootloader.upload=upload.bootloader

##############################################################
#Board Description

diecimila.name=Arduino Diecimila, Duemilanove, or Nano w/ ATmega168
diecimila.group=Arduino

diecimila.build.core=arduino
diecimila.build.mcu=atmega168
diecimila.build.f_cpu=16000000L

diecimila.reference=hardware/cores/arduino/reference/index.html

diecimila.upload.protocol=stk500
diecimila.upload.maximum_size=14336
diecimila.upload.speed=19200
diecimila.upload.mcu=m168

diecimila.bootloader.low_fuses=0xff
diecimila.bootloader.high_fuses=0xdd
diecimila.bootloader.extended_fuses=0x00
diecimila.bootloader.path=atmega
diecimila.bootloader.file=ATmegaBOOT_168_diecimila.hex
diecimila.bootloader.unlock_bits=0x3F
diecimila.bootloader.lock_bits=0x0F

#ANT core targets
diecimila.targets.sketch.verify=build.all
diecimila.targets.sketch.upload=upload.sketch
diecimila.targets.bootloader.upload=upload.bootloader

##############################################################
#Board Description

touchSlide.name=TouchShield
touchSlide.group=Arduino
touchSlide.build.core=touchSlide
touchSlide.build.mcu=atmega2560
touchSlide.build.f_cpu=16000000L
touchSlide.reference=hardware/cores/arduino/reference/index.html

touchSlide.upload.protocol=butterfly
touchSlide.upload.maximum_size=250000
touchSlide.upload.speed=57600
touchSlide.upload.mcu=m2560

#ANT core targets
touchSlide.targets.sketch.verify=build.all
touchSlide.targets.sketch.upload=upload.sketch
touchSlide.targets.bootloader.upload=upload.bootloader
